/*
* Задание:
*   Вычислить значение выражения по формуле (все переменные принимают действительные значения): ( 1-tg(x) ) ^ ( ctg(x) ) + cos(x-y)
*
* О программе:
*   Данная программа выполняет вычисление по формуле в соответствии с введенными данными
*   Проверяет входные данные на корректность,
*
* Ввод:
*
*
* Примеры ввода:
*
*
* Вывод:
*
*
* Пример вывода:
*
*
* Разработано:
*	Петров Д. В.
*
* Дата:
*	11.09.2022
*
* История версий:
*	v1.0 - начальная версия
*/

#include <iostream>
#include <Windows.h>

int main()
{
    setlocale(LC_ALL, "PL_pl.UTF-8");
    SetConsoleCP(CP_UTF8);
    SetConsoleOutputCP(CP_UTF8);



    return 0;
}
